nxp-mcuxpresso/mcux-soc-svd/MCXW236/MCXW236.xml
        <register>
          <name>FMUPARAM1_ARRAY3</name>
          <description>SMW timer options, SMW setting options</description>
          <alternateGroup>FMUPARAM1_ARRAY</alternateGroup>
          <addressOffset>0x161C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM1_3</name>
          <description>SMW timer options, SMW setting options</description>
          <alternateGroup>FMUPARAM1</alternateGroup>
          <addressOffset>0x161C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARAM2_ARRAY0</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2_ARRAY</alternateGroup>
          <addressOffset>0x1620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM2_0</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2</alternateGroup>
          <addressOffset>0x1620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARAM2_ARRAY1</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2_ARRAY</alternateGroup>
          <addressOffset>0x1624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM2_1</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2</alternateGroup>
          <addressOffset>0x1624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARAM2_ARRAY2</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2_ARRAY</alternateGroup>
          <addressOffset>0x1628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM2_2</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2</alternateGroup>
          <addressOffset>0x1628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARAM2_ARRAY3</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2_ARRAY</alternateGroup>
          <addressOffset>0x162C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM2_3</name>
          <description>SMW setting options continued, SMW smart program/erase options</description>
          <alternateGroup>FMUPARAM2</alternateGroup>
          <addressOffset>0x162C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM3</name>
          <description>SMW smart erase options continued</description>
          <addressOffset>0x1630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM4</name>
          <description>Array size (see MSIZE register)</description>
          <addressOffset>0x1640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMUPARM5</name>
          <description>TME control (see FTEST register)</description>
          <addressOffset>0x1650</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIMEN</name>
          <description>C0DE_C0DE field at [31:0] to enable loading of SoC trim settings</description>
          <addressOffset>0x17E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIMECC</name>
          <description>C0DE_C0DE field at [31:0] for controlling ECC decoder while fetching SoC trim settings</description>
          <addressOffset>0x17F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_0</name>
          <description>GPO0 register 0 description</description>
          <alternateGroup>GPO0</alternateGroup>
          <addressOffset>0x1800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRO_TRIM_VALID</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRO32K_NTAT</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRO32K_PTAT</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRO32K_CAPCAL</name>
              <description>no description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMIC_ONLY</name>
              <description>no description available</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDC</name>
              <description>no description available</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_ARRAY0</name>
          <description>GPO0 array description</description>
          <alternateGroup>GPO0_ARRAY</alternateGroup>
          <addressOffset>0x1800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_1</name>
          <description>GPO0 register 1 description</description>
          <alternateGroup>GPO0</alternateGroup>
          <addressOffset>0x1804</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_ARRAY1</name>
          <description>GPO0 array description</description>
          <alternateGroup>GPO0_ARRAY</alternateGroup>
          <addressOffset>0x1804</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_2</name>
          <description>GPO0 register 2 description</description>
          <alternateGroup>GPO0</alternateGroup>
          <addressOffset>0x1808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYSTEM_SPEED_CODE</name>
              <description>System speed code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_CTRL_OPMODE</name>
              <description>System speed code</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_ARRAY2</name>
          <description>GPO0 array description</description>
          <alternateGroup>GPO0_ARRAY</alternateGroup>
          <addressOffset>0x1808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_3</name>
          <description>GPO0 register 3 description</description>
          <alternateGroup>GPO0</alternateGroup>
          <addressOffset>0x180C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO0_ARRAY3</name>
          <description>GPO0 array description</description>
          <alternateGroup>GPO0_ARRAY</alternateGroup>
          <addressOffset>0x180C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO1_0</name>
          <description>GPO1 register 0 description</description>
          <alternateGroup>GPO1</alternateGroup>
          <addressOffset>0x1810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FINAL_TEST_NOT_DONE</name>
              <description>FINAL_TEST_NOT_DONE[7:4]: 1010 : Final Test Not Done. All Other values: Final Test Done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARTCONFIG</name>
              <description>Device type number. (E.g : MCXW23 stored as 04 decimal)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVICE_TYPE_SEC</name>
              <description>Security device type: 0: NHS52xx (Non Secure Family) 1: NHS52Sxx (Secure Family)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_SIZE</name>
              <description>SRAM_SIZE[3:0]</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM33_SECURITY_EXTENSION_DISABLE</name>
              <description>CM33_SECURITY_EXTENSION_DISABLE[7:4]: 1010 : CM33 Security Extension is disabled. All Other values: CM33 Security Extension is enabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_REVISION_MINOR</name>
              <description>ROM Revision-Minor [3:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>METAL_REVISION_ID</name>
              <description>METAL REVISION ID[3:0]</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO1_ARRAY0</name>
          <description>GPO1 array description</description>
          <alternateGroup>GPO1_ARRAY</alternateGroup>
          <addressOffset>0x1810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO1_1</name>
          <description>GPO1 register 1 description</description>
          <alternateGroup>GPO1</alternateGroup>
          <addressOffset>0x1814</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROM_PATCH_VERSION</name>
              <description>ROM Patch Version [3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUSTOMER_REVISION_ID</name>
              <description>CUSTOMER REVISION ID[3:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPO1_ARRAY1</name>
          <description>GPO1 array description</description>
          <alternateGroup>GPO1_ARRAY</alternateGroup>
          <addressOffset>0x1814</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIELD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
