nxp-mcuxpresso/mcux-soc-svd/MCXW236/MCXW236.xml
        <register>
          <name>DEBUG_LOCK_EN</name>
          <description>Write-once register to control write access to security registers.</description>
          <addressOffset>0xFA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>LOCK_ALL</name>
              <description>Control write access to security registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b1010: disable write access to all registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>1010: Enable write access to all registers.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_FEATURES</name>
          <description>Cortex debug features control.</description>
          <addressOffset>0xFA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>CPU0_DBGEN</name>
              <description>CPU0 Invasive debug control:.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_NIDEN</name>
              <description>CPU0 Non Invasive debug control:.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_SPIDEN</name>
              <description>CPU0 Secure Invasive debug control:.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_SPNIDEN</name>
              <description>CPU0 Secure Non Invasive debug control:.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_FEATURES_DP</name>
          <description>Cortex debug features control. (duplicate)</description>
          <addressOffset>0xFA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x555</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>CPU0_DBGEN</name>
              <description>CPU0 (CPU0) Invasive debug control:.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_NIDEN</name>
              <description>CPU0 Non Invasive debug control:.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_SPIDEN</name>
              <description>CPU0 Secure Invasive debug control:.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU0_SPNIDEN</name>
              <description>CPU0 Secure Non Invasive debug control:.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Any other value than b10: invasive debug is disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>10: Invasive debug is enabled.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CODESECURITYPROTTEST</name>
          <description>Security code to allow test (Design for Testability) access.</description>
          <addressOffset>0xFB0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CODE</name>
              <description>Security code to allow test access : 0x12345678.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>test access is not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Security code to allow test access.</description>
                  <value>0x12345678</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_ACCESS_CPU0</name>
          <description>This register is used by ROM during DEBUG authentication mechanism to enable debug access port for CPU0.</description>
          <addressOffset>0xFB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CODE</name>
              <description>CPU0 SWD-AP: 0x12345678.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>CPU0 DAP is not allowed. Reading back register will be read as 0x5.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Value to write to enable CPU0 SWD access. Reading back register will be read as 0xA.</description>
                  <value>0x12345678</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_BLOCK</name>
          <description>block quiddikey/PUF all index.</description>
          <addressOffset>0xFBC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x3CC35AA5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY_BLOCK</name>
              <description>Write a value to block quiddikey/PUF all index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_AUTH_BEACON</name>
          <description>Debug authentication BEACON register</description>
          <addressOffset>0xFC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BEACON</name>
              <description>Set by the debug authentication code in ROM to pass the debug beacons (Credential Beacon and Authentication Beacon) to application code.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHSIZECFG</name>
          <description>Flash size configuration</description>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>FLASHSIZE</name>
              <description>Flash_size.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_0KB</name>
                  <description>0KB when 9'b000000000.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_128KB</name>
                  <description>0KB when 9'b000000001.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_256KB</name>
                  <description>256KB when 9'b000000010.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_384KB</name>
                  <description>256KB when 9'b000000011.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_512KB</name>
                  <description>512KB when 9'b000000100.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_640KB</name>
                  <description>512KB when 9'b000000101.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_768KB</name>
                  <description>768KB when 9'b000000110.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_896KB</name>
                  <description>768KB when 9'b000000111.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_1016KB</name>
                  <description>1016KB when others.</description>
                  <value>0x1FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHSTART</name>
              <description>Flash start address.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START_0KB</name>
                  <description>No private flash space in the main flash array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_8KB</name>
                  <description>Private flash start 8kB before last address.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIGLOCKOUT</name>
          <description>Disable write access to FLASHSIZECFG, SRAMSIZECFG, CPUCFG.</description>
          <addressOffset>0xFE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Disable write access to FLASHSIZECFG, SRAMSIZECFG and PERIPHENCFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable write access to FLASHSIZECFG, SRAMSIZECFG and PERIPHENCFG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable write access to FLASHSIZECFG, SRAMSIZECFG and PERIPHENCFG</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHBANK0_LOCK</name>
              <description>Disable write access to the BANK0 field in the FLASHBANKENABLE register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable write access to the BANK0 field in the FLASHBANKENABLE register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable write access to the BANK0 field in the FLASHBANKENABLE register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHBANK1_LOCK</name>
              <description>Disable write access to the BANK1 field in the FLASHBANKENABLE register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable write access to the BANK1 field in the FLASHBANKENABLE register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable write access to the BANK1 field in the FLASHBANKENABLE register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHBANK2_LOCK</name>
              <description>Disable write access to the BANK2 field in the FLASHBANKENABLE register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable write access to the BANK2 field in the FLASHBANKENABLE register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable write access to the BANK2 field in the FLASHBANKENABLE register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHBANK3_LOCK</name>
              <description>Disable write access to the BANK3 field in the FLASHBANKENABLE register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable write access to the BANK3 field in the FLASHBANKENABLE register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable write access to the BANK3 field in the FLASHBANKENABLE register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
