nxp-mcuxpresso/mcux-soc-svd/MCXW236/MCXW236.xml
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_RADIO_RESTART</name>
                  <description>BLE Power FSM : Low Power Mode - radio restart</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_OSC_ENABLE</name>
                  <description>BLE Power FSM : Low Power Mode - enable oscillator</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_ASSERT_ISO_AND_RESETS</name>
                  <description>BLE Power FSM : Power off mode - assert isolation and resets</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_CLOCK_OUT_ENABLE</name>
                  <description>BLE Power FSM : Low Power Mode - enable clock output</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_OSC_ENABLE</name>
                  <description>BLE Power FSM : Power off mode - enable oscillator</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_CLOCK_OUT_ENABLE</name>
                  <description>BLE Power FSM : Power off mode - enable clock out</description>
                  <value>0x19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETCTRL</name>
          <description>Reset Control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DPDWAKEUPRESETENABLE</name>
              <description>Wake-up from DEEP POWER DOWN reset event (either from wake up I/O or RTC enable).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Reset event from DEEP POWER DOWN mode is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Reset event from DEEP POWER DOWN mode is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRRESETENABLE</name>
              <description>Software reset enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Software reset is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Software reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD1RESETENA_SECURE</name>
              <description>BOD1 reset enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Any other value than b10, BOD1 reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD1 reset is disable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD2RESETENA_SECURE</name>
              <description>BOD2 reset enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Any other value than b10, BOD2 reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD2 reset is disable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCERRORRESETENABLE</name>
              <description>CPU retention CRC error reset enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>CPU retention CRC error reset is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>CPU retention CRC error reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD1RESETENA_SECURE_DP</name>
              <description>BOD1 reset enable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Any other value than b10, BOD1 reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD1 reset is disable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD2RESETENA_SECURE_DP</name>
              <description>BOD2 reset enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Any other value than b10, BOD2 reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD2 reset is disable.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETCAUSE</name>
          <description>Reset Cause register [Reset by: PoR]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>1 : The last chip reset was caused by a Power On Reset. Write '1' to clear this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PADRESET</name>
              <description>1 : The last chip reset was caused by a Pin Reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BODRESET</name>
              <description>1 : The last chip reset was caused by a Brown Out Detector.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTEMRESET</name>
              <description>1 : The last chip reset was caused by a System Reset requested by the ARM CPU.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTRESET</name>
              <description>1 : The last chip reset was caused by the Watchdog Timer.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWRRESET</name>
              <description>1 : The last chip reset was caused by a Software reset.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_WAKEUPIO</name>
              <description>1 : The last chip reset was caused by a Wake-up I/O reset event during DEEP POWER DOWN mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_RTC</name>
              <description>1 : The last chip reset was caused by RTC.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDRESET_OSTIMER</name>
              <description>1 : The last chip reset was caused by OS Event Timer reset event during DEEP POWER DOWN mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDOGRESET</name>
              <description>1 : The last chip reset was caused by the code Watchdog.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEWUP</name>
              <description>1 : The last chip wakeup was caused by the BLE Timer wakeup.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCERROR</name>
              <description>1 : The last chip reset was caused by a CRC error during CPU state retention restore.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC0</name>
          <description>DCDC control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x94071</resetValue>
          <resetMask>0x7FF0FF</resetMask>
          <fields>
            <field>
              <name>VOLTAGE</name>
              <description>DCDC output voltage level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RC</name>
              <description>Calibration RC time for Buck mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDUCTOR</name>
              <description>Scale current mirror</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_1P0</name>
                  <description>1.0 uH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_2P2</name>
                  <description>2.2 uH</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_4P7</name>
                  <description>4.7 uH</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PASSTHROUGH_EN</name>
              <description>Enable pass through 0: disabled 1: enabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMNZCD</name>
              <description>Trim bits N-ZCD</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMPZCD</name>
              <description>Trim bits P-ZCD</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BYPASS</name>
              <description>Enable low power bypass switch</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROBUST_STARTUP_DISABLE</name>
              <description>Block BOD controlled DCDC buck and boost control</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIAS</name>
          <description>Bias current source control register [Reset by: PoR, Pin Reset, Software Reset]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8450</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DCSHIFT</name>
              <description>Trimming bits to adjust DC shift</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CURVE</name>
              <description>Trimming bits to adjust deviations in curvature on silicon</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IREFTRIM</name>
              <description>Bias current trimming</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPDCSHIFT</name>
              <description>Trimming bits to adjust DC shift in low power mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOMEM</name>
          <description>LDOMEM</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>VADJ</name>
              <description>Sets the LDO output level (4 bit, only 2 LSB used).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADJ_PWD</name>
              <description>Sets the LDO output level to 0.63V or 0.66V in low power mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDODIG</name>
          <description>LDODIG</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>VADJ</name>
              <description>Sets the LDO output level (4 bit, only 2 LSB used).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADJ_PWD</name>
              <description>Sets the LDO output level to 0.63V or 0.66V in low power mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
