nxp-mcuxpresso/mcux-soc-svd/MCXW236/MCXW236.xml
        <register>
          <name>BOD1</name>
          <description>BOD1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x64</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>TRIGLVL</name>
              <description>BOD Trigger level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_1P00</name>
                  <description>1.00 V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P05</name>
                  <description>1.05 V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P10</name>
                  <description>1.10 V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P15</name>
                  <description>1.15 V.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P20</name>
                  <description>1.20 V.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P25</name>
                  <description>1.25 V.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P30</name>
                  <description>1.30 V.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P35</name>
                  <description>1.35 V.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P40</name>
                  <description>1.40 V.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P45</name>
                  <description>1.45 V.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P50</name>
                  <description>1.50 V.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P60</name>
                  <description>1.60 V.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P70</name>
                  <description>1.70 V.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P80</name>
                  <description>1.80 V.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P90</name>
                  <description>1.90 V.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P00</name>
                  <description>2.00 V.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P10</name>
                  <description>2.10 V.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P20</name>
                  <description>2.20 V.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P30</name>
                  <description>2.30 V.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P40</name>
                  <description>2.40 V.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P50</name>
                  <description>2.50 V.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P60</name>
                  <description>2.60 V.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P70</name>
                  <description>2.70 V.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P80</name>
                  <description>2.80 V.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P90</name>
                  <description>2.90 V.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P00</name>
                  <description>3.00 V.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P10</name>
                  <description>3.10 V.</description>
                  <value>0x1A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>BOD Hysteresis control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYST_25MV</name>
                  <description>25 mV.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_50MV</name>
                  <description>50 mV.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_75MV</name>
                  <description>75 mV.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_100MV</name>
                  <description>100 mV.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>BOD Operation mode select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVELDETECT</name>
                  <description>Level detector mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD</name>
                  <description>BOD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVLSEL</name>
              <description>BOD Level select when mode is set to zero</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMMED</name>
                  <description>Reference is sum of threshold plus hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRESHOLD</name>
                  <description>Reference is threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD2</name>
          <description>BOD2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x73</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>TRIGLVL</name>
              <description>BOD Trigger level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_1P00</name>
                  <description>1.00 V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P05</name>
                  <description>1.05 V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P10</name>
                  <description>1.10 V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P15</name>
                  <description>1.15 V.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P20</name>
                  <description>1.20 V.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P25</name>
                  <description>1.25 V.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P30</name>
                  <description>1.30 V.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P35</name>
                  <description>1.35 V.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P40</name>
                  <description>1.40 V.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P45</name>
                  <description>1.45 V.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P50</name>
                  <description>1.50 V.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P60</name>
                  <description>1.60 V.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P70</name>
                  <description>1.70 V.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P80</name>
                  <description>1.80 V.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1P90</name>
                  <description>1.90 V.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P00</name>
                  <description>2.00 V.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P10</name>
                  <description>2.10 V.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P20</name>
                  <description>2.20 V.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P30</name>
                  <description>2.30 V.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P40</name>
                  <description>2.40 V.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P50</name>
                  <description>2.50 V.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P60</name>
                  <description>2.60 V.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P70</name>
                  <description>2.70 V.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P80</name>
                  <description>2.80 V.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_2P90</name>
                  <description>2.90 V.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P00</name>
                  <description>3.00 V.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_3P10</name>
                  <description>3.10 V.</description>
                  <value>0x1A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>BOD Hysteresis control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYST_25MV</name>
                  <description>25 mV.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_50MV</name>
                  <description>50 mV.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_75MV</name>
                  <description>75 mV.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYST_100MV</name>
                  <description>100 mV.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>BOD Operation mode select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVELDETECT</name>
                  <description>Level detector mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD</name>
                  <description>BOD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVLSEL</name>
              <description>BOD Level select when mode is set to zero</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUMMED</name>
                  <description>Reference is sum of threshold plus hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRESHOLD</name>
                  <description>Reference is threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRO192M</name>
          <description>FRO192M</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8C2DF</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>BIAS</name>
              <description>Coarse frequency trimming</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUR_DAC</name>
              <description>Fine frequency trimming</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TC</name>
              <description>Temperature compensation</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
