nxp-mcuxpresso/mcux-soc-svd/MCXW236/MCXW236.xml
        <register>
          <name>FRO1M</name>
          <description>1 MHz Free Running Oscillator control register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x66</resetValue>
          <resetMask>0x3E7F</resetMask>
          <fields>
            <field>
              <name>FREQSEL</name>
              <description>Frequency trimming bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVSEL</name>
              <description>Divider selection bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>2.0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>4.0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>6.0.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>8.0.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>10.0.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>12.0.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>14.0.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>16.0.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <description>18.0.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>20.0.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <description>22.0.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>24.0.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_26</name>
                  <description>26.0.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <description>28.0.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_30</name>
                  <description>30.0.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <description>32.0.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_34</name>
                  <description>34.0.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_36</name>
                  <description>36.0.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_38</name>
                  <description>38.0.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_40</name>
                  <description>40.0.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_42</name>
                  <description>42.0.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_44</name>
                  <description>44.0.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_46</name>
                  <description>46.0.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_48</name>
                  <description>48.0.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_50</name>
                  <description>50.0.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_52</name>
                  <description>52.0.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_54</name>
                  <description>54.0.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_56</name>
                  <description>56.0.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_58</name>
                  <description>58.0.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_60</name>
                  <description>60.0.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_62</name>
                  <description>62.0.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>1.0.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRO32K</name>
          <description>32 KHz Free Running Oscillator (FRO) control register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7FB6</resetValue>
          <resetMask>0xFFFE</resetMask>
          <fields>
            <field>
              <name>NTAT</name>
              <description>Temperature coefficient trimming bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTAT</name>
              <description>Bias trimming bits (coarse frequency trimming).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPCAL</name>
              <description>Capacitive dac calibration bits (fine frequency trimming).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTAL32K</name>
          <description>32 KHz Crystal oscillator (XTAL) control register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x42</resetValue>
          <resetMask>0xFFC6</resetMask>
          <fields>
            <field>
              <name>GM</name>
              <description>Reference output current selection inputs</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTM</name>
              <description>Oscillator bypass mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPL</name>
              <description>Oscillator amplitude selection inputs</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_OSCIN</name>
              <description>osc_in capacitorbank selection inputs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP_OSCOUT</name>
              <description>osc_out capacitorbank selection inputs</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALBLE</name>
          <description>BLE XTAL overrule</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CKO_UNGATE_OVERRULE</name>
              <description>Defines whether the Link Layer HW gets a clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The clock going to the Link Layer HW is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The clock going to the Link Layer HW is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUPIOCTRL</name>
          <description>WAKEUPIOCTRL</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x401</resetValue>
          <resetMask>0x701</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable / disable wake up on Wake Up pin in Deep Power Down modes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUP_EN</name>
              <description>Enable/disable Wakeup pin Pull-up in PowerOff mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pull-up</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable pull-up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDN_EN</name>
              <description>Enable/disable Wakeup pin Pull-down in PowerOff mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable pull-down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable pull-down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL</name>
              <description>Select Wakeup pin event level in PowerOff</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_LOW</name>
                  <description>Wakeup on low level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_HIGH</name>
                  <description>Wakeup on high level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUPIO_RSTN</name>
              <description>WAKEUP IO event detector reset control. When this bit is, the RESETCAUSE register is updated when the wakeup IO causes a wakeup event.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Bloc is reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RELEASED</name>
                  <description>Bloc is not reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEIOCAUSE</name>
          <description>Allows to identify the Wake-up I/O source from Deep Power Down mode</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WAKEUP0</name>
              <description>Allows to identify Wake up I/O 0 as the wake-up source from Deep Power Down mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOEVENT</name>
                  <description>Last wake up from Deep Power down mode was NOT triggred by wake up I/O 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT</name>
                  <description>Last wake up from Deep Power down mode was triggred by wake up I/O 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSPWR</name>
          <description>STATUSPWR</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FFFFF</resetMask>
          <fields>
            <field>
              <name>DCDCMODE</name>
              <description>DCDC Mode 01: Buck mode 10: Boost mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDCOK</name>
              <description>DCDC power OK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDODIGOK</name>
              <description>LDODIG power OK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDOMEMOK</name>
              <description>LDOMEM power OK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DURATION</name>
              <description>DCDC Startup duration in us.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSCLK</name>
          <description>FRO and XTAL status register [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>XTAL32KOK</name>
              <description>XTAL oscillator 32K OK signal. Note : Bit not working as expected. See artf872570</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRO1MCLKVALID</name>
              <description>FRO 1 MHz CCO voltage detector output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL32KOSCFAILURE</name>
              <description>XTAL32 KHZ oscillator oscillation failure detection indicator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOFAIL</name>
                  <description>No oscillation failure has been detetced since the last time this bit has been cleared..</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAILURE</name>
                  <description>At least one oscillation failure has been detetced since the last time this bit has been cleared..</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AOREG0</name>
          <description>Write-once general purpose always on domain data storage [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA31_0</name>
              <description>General purpose always on domain data storage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AOREG1</name>
          <description>General purpose always on domain data storage [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA31_0</name>
              <description>Write-once general purpose always on domain data storage [Reset by: PoR, Brown Out Detectors Reset]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AOREG2</name>
          <description>AOREG2</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA31_0</name>
              <description>General purpose always on domain data storage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
